benchmarks/products-3-replica-1000-conn-1-th.log
Running 30s test @ http://localhost/products
  1 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   506.45ms  288.30ms   1.82s    68.33%
    Req/Sec     1.03k   611.04     3.20k    69.58%
  30447 requests in 30.10s, 42.92MB read
  Socket errors: connect 0, read 173268, write 0, timeout 0
Requests/sec:   1011.54
Transfer/sec:      1.43MB